cmsis-svd/cmsis-svd/data/Fujitsu/MB9BFD1xS.xml
<?xml version="1.0" encoding="utf-8"?>
<!-- ******************************************************************************* -->
<!-- Copyright (C) 2013 Spansion LLC. All Rights Reserved.                           -->
<!--                                                                                 -->
<!-- This software is owned and published by:                                        -->
<!-- Spansion LLC, 915 DeGuigne Dr. Sunnyvale, CA  94088-3453 ("Spansion").          -->
<!--                                                                                 -->
<!-- BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND        -->
<!-- BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.                              -->
<!--                                                                                 -->
<!-- This software contains source code for use with Spansion                        -->
<!-- components. This software is licensed by Spansion to be adapted only            -->
<!-- for use in systems utilizing Spansion components. Spansion shall not be         -->
<!-- responsible for misuse or illegal use of this software for devices not          -->
<!-- supported herein.  Spansion is providing this software "AS IS" and will         -->
<!-- not be responsible for issues arising from incorrect user implementation        -->
<!-- of the software.                                                                -->
<!--                                                                                 -->
<!-- SPANSION MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,    -->
<!-- REGARDING THE SOFTWARE (INCLUDING ANY ACOOMPANYING WRITTEN MATERIALS),          -->
<!-- ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,                -->
<!-- WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED        -->
<!-- WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED            -->
<!-- WARRANTY OF NONINFRINGEMENT.                                                    -->
<!-- SPANSION SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,          -->
<!-- NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT         -->
<!-- LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,        -->
<!-- LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR      -->
<!-- INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,       -->
<!-- INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,         -->
<!-- SAVINGS OR PROFITS,                                                             -->
<!-- EVEN IF SPANSION HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.           -->
<!-- YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR   -->
<!-- INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED     -->
<!-- FROM, THE SOFTWARE.                                                             -->
<!--                                                                                 -->
<!-- This software may be replicated in part or whole for the licensed use,          -->
<!-- with the restriction that this Disclaimer and Copyright notice must be          -->
<!-- included with each copy of this software, whether used in part or whole,        -->
<!-- at all times.                                                                   -->
<!-- ******************************************************************************* -->
<!-- 2014.6.20 generated by svdgen_v03a -->
<device schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_0.xsd">
 <name>MB9BFD1xS</name>
 <version>1.8</version>
 <description>MB9BFD1xS</description>
 <addressUnitBits>8</addressUnitBits>
 <width>32</width>
 <size>32</size>
 <access>read-write</access>
 <resetValue>0x00000000</resetValue>
 <resetMask>0x00000000</resetMask>
 <peripherals>
   <!-- ************************************************************************************** -->
   <!-- peripheral:FlashMemory -->
   <!-- ************************************************************************************** -->
    <!-- PERIPHERAL "FLASH_IF" -->
    <peripheral>
      <name>FLASH_IF</name>
      <description>Flash Memory</description>
      <groupName>FLASH_IF</groupName>
      <baseAddress>0x40000000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "FASZR" -->
        <register>
          <name>FASZR</name>
          <description>Flash Access Size Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ASZ" -->
            <field>
              <name>ASZ</name>
              <description>Flash Access Size </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FRWTR" -->
        <register>
          <name>FRWTR</name>
          <description>Flash Read Wait Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RWT" -->
            <field>
              <name>RWT</name>
              <description>Read Wait Cycle</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FSTR" -->
        <register>
          <name>FSTR</name>
          <description>Flash Status Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ERR" -->
            <field>
              <name>ERR</name>
              <description>Flash ECC Error </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HNG" -->
            <field>
              <name>HNG</name>
              <description>Flash Hang flag</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDY" -->
            <field>
              <name>RDY</name>
              <description>Flash Rdy</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FSYNDN" -->
        <register>
          <name>FSYNDN</name>
          <description>Flash Sync Down Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SD" -->
            <field>
              <name>SD</name>
              <description>Flash Sync</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
