cmsis-svd/cmsis-svd/data/Fujitsu/MB9BFD1xS.xml
        <!-- REGISTER "IRQ32MON" -->
        <register>
          <name>IRQ32MON</name>
          <description>IRQ32 Batch Read Register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MAC0LPI" -->
            <field>
              <name>MAC0LPI</name>
              <description>LPI interrupt request of Ethernet MAC ch.0 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MAC0PMI" -->
            <field>
              <name>MAC0PMI</name>
              <description>PMI interrupt request of Ethernet MAC ch.0 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MAC0SBD" -->
            <field>
              <name>MAC0SBD</name>
              <description>SBD interrupt request of Ethernet MAC ch.0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CAN0INT" -->
            <field>
              <name>CAN0INT</name>
              <description>Interrupt request of CAN ch.0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ33MON" -->
        <register>
          <name>IRQ33MON</name>
          <description>IRQ33 Batch Read Register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MAC1LPI" -->
            <field>
              <name>MAC1LPI</name>
              <description>LPI interrupt request of Ethernet MAC ch.1 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MAC1PMI" -->
            <field>
              <name>MAC1PMI</name>
              <description>PMI interrupt request of Ethernet MAC ch.1 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MAC1SBD" -->
            <field>
              <name>MAC1SBD</name>
              <description>SBD interrupt request of Ethernet MAC ch.1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CAN1INT" -->
            <field>
              <name>CAN1INT</name>
              <description>Interrupt request of CAN ch.1 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ34MON" -->
        <register>
          <name>IRQ34MON</name>
          <description>IRQ34 Batch Read Register</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "USB0INT4" -->
            <field>
              <name>USB0INT4</name>
              <description>Endpoint 5 DRQ interrupt request on the USB ch.0 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB0INT3" -->
            <field>
              <name>USB0INT3</name>
              <description>Endpoint 4 DRQ interrupt request on the USB ch.0 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB0INT2" -->
            <field>
              <name>USB0INT2</name>
              <description>Endpoint 3 DRQ interrupt request on the USB ch.0 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB0INT1" -->
            <field>
              <name>USB0INT1</name>
              <description>Endpoint 2 DRQ interrupt request on the USB ch.0 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB0INT0" -->
            <field>
              <name>USB0INT0</name>
              <description>Endpoint 1 DRQ interrupt request on the USB ch.0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ35MON" -->
        <register>
          <name>IRQ35MON</name>
          <description>IRQ35 Batch Read Register</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "USB0INT5" -->
            <field>
              <name>USB0INT5</name>
              <description>"Status (SOFIRQ, CMPIRO) interrupt request on the USB ch.0 "</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB0INT4" -->
            <field>
              <name>USB0INT4</name>
              <description>"Status (DIRQ, URIRQ, RWKIRQ, CNNIRQ) interrupt request on the USB ch.0 "</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB0INT3" -->
            <field>
              <name>USB0INT3</name>
              <description>Status (SPK) interrupt request on the USB ch.0 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB0INT2" -->
            <field>
              <name>USB0INT2</name>
              <description>"Status (SUSP, SOF, BRST, CONF, WKUP) interrupt request on the USB ch.0 "</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB0INT1" -->
            <field>
              <name>USB0INT1</name>
              <description>Endpoint 0 DRQO interrupt request on the USB ch.0 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB0INT0" -->
            <field>
              <name>USB0INT0</name>
              <description>Endpoint 0 DRQI interrupt request on the USB ch.0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
