cmsis-svd/cmsis-svd/data/Fujitsu/MB9BFD1xS.xml
        <!-- REGISTER "EP0IS" -->
        <register>
          <name>EP0IS</name>
          <description>EP0I Status Register</description>
          <addressOffset>0x2144</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8400</resetValue>
          <resetMask>0xC400</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BFINI" -->
            <field>
              <name>BFINI</name>
              <description>Send Buffer Initialization bit </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRQIIE" -->
            <field>
              <name>DRQIIE</name>
              <description>Send Data Interrupt Enable bit</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRQI" -->
            <field>
              <name>DRQI</name>
              <description>Send/Receive Data Interrupt Request bit</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP0OS" -->
        <register>
          <name>EP0OS</name>
          <description>EP0O Status Register</description>
          <addressOffset>0x2148</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8000</resetValue>
          <resetMask>0xE67F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BFINI" -->
            <field>
              <name>BFINI</name>
              <description>Receive Buffer Initialization bit</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRQOIE" -->
            <field>
              <name>DRQOIE</name>
              <description>Receive Data Interrupt Enable bit</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPKIE" -->
            <field>
              <name>SPKIE</name>
              <description>Short Packet Interrupt Enable bit </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRQO" -->
            <field>
              <name>DRQO</name>
              <description>Receive Data Interrupt Request bit </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPK" -->
            <field>
              <name>SPK</name>
              <description>Short Packet Interrupt Request bit</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIZE" -->
            <field>
              <name>SIZE</name>
              <description>Packet Size Indication bit</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP1S" -->
        <register>
          <name>EP1S</name>
          <description>EP1 Status Register</description>
          <addressOffset>0x214C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8000</resetValue>
          <resetMask>0xEFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BFINI" -->
            <field>
              <name>BFINI</name>
              <description>Send/Receive Buffer Initialization bit</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRQIE" -->
            <field>
              <name>DRQIE</name>
              <description>Packet Transfer Interrupt Enable bit</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPKIE" -->
            <field>
              <name>SPKIE</name>
              <description>Short Packet Interrupt Enable bit</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BUSY" -->
            <field>
              <name>BUSY</name>
              <description>Busy Flag bit </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DRQ" -->
            <field>
              <name>DRQ</name>
              <description>Packet Transfer Interrupt Request bit </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPK" -->
            <field>
              <name>SPK</name>
              <description>Short Packet Interrupt Request bit</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIZE" -->
            <field>
              <name>SIZE</name>
              <description>packet SIZE</description>
              <lsb>0</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP2S" -->
        <register>
          <name>EP2S</name>
          <description>EP2 Status Register</description>
          <addressOffset>0x2150</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8000</resetValue>
          <resetMask>0xEFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BFINI" -->
            <field>
              <name>BFINI</name>
              <description>Send/Receive Buffer Initialization bit</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRQIE" -->
            <field>
              <name>DRQIE</name>
              <description>Packet Transfer Interrupt Enable bit</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPKIE" -->
            <field>
              <name>SPKIE</name>
              <description>Short Packet Interrupt Enable bit</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BUSY" -->
            <field>
              <name>BUSY</name>
              <description>Busy Flag bit </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DRQ" -->
            <field>
              <name>DRQ</name>
              <description>Packet Transfer Interrupt Request bit </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPK" -->
            <field>
              <name>SPK</name>
              <description>Short Packet Interrupt Request bit</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIZE" -->
            <field>
              <name>SIZE</name>
              <description>packet SIZE</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP3S" -->
        <register derivedFrom="EP2S">
          <name>EP3S</name>
          <description>EP3 Status Register</description>
          <addressOffset>0x2154</addressOffset>
        </register>
        <!-- REGISTER "EP4S" -->
        <register derivedFrom="EP2S">
          <name>EP4S</name>
          <description>EP4 Status Register</description>
          <addressOffset>0x2158</addressOffset>
        </register>
        <!-- REGISTER "EP5S" -->
        <register derivedFrom="EP2S">
          <name>EP5S</name>
          <description>EP5 Status Register</description>
          <addressOffset>0x215C</addressOffset>
        </register>
