cmsis-svd/cmsis-svd/data/Fujitsu/MB9BFD1xS.xml
        <!-- REGISTER "MAR31L" -->
        <register derivedFrom="MAR1L">
          <name>MAR31L</name>
          <description>MAC Address31 Register -Low</description>
          <addressOffset>0x87C</addressOffset>
        </register>
        <!-- REGISTER "BMR" -->
        <register>
          <name>BMR</name>
          <description>Bus Mode Register</description>
          <addressOffset>0x1000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00020101</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXPR" -->
            <field>
              <name>TXPR</name>
              <description>Transmit Priority</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MB" -->
            <field>
              <name>MB</name>
              <description>Mixed Burst</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AAL" -->
            <field>
              <name>AAL</name>
              <description>Address-Aligned Beats</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "_8XPBL" -->
            <field>
              <name>_8XPBL</name>
              <description>8xPBL Mode</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USP" -->
            <field>
              <name>USP</name>
              <description>Use Separate PBL</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RPBL" -->
            <field>
              <name>RPBL</name>
              <description>RxDMA PBL</description>
              <lsb>17</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FB" -->
            <field>
              <name>FB</name>
              <description>Fixed Burst</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PR" -->
            <field>
              <name>PR</name>
              <description>Rx:Tx priority ratio</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PBL" -->
            <field>
              <name>PBL</name>
              <description>Programmable Burst Length</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ATDS" -->
            <field>
              <name>ATDS</name>
              <description>Alternate Descriptor Size</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DSL" -->
            <field>
              <name>DSL</name>
              <description>Descriptor Skip Length</description>
              <lsb>2</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA" -->
            <field>
              <name>DA</name>
              <description>DMA Arbitration scheme</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SWR" -->
            <field>
              <name>SWR</name>
              <description>Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TPDR" -->
        <register>
          <name>TPDR</name>
          <description>Transmit Poll Demand Register)</description>
          <addressOffset>0x1004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TPD" -->
            <field>
              <name>TPD</name>
              <description>Transmit Poll Demand</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RPDR" -->
        <register>
          <name>RPDR</name>
          <description>Receive Poll Demand Register</description>
          <addressOffset>0x1008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RPD" -->
            <field>
              <name>RPD</name>
              <description>Receive Poll Demand</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RDLAR" -->
        <register>
          <name>RDLAR</name>
          <description>Receive Descriptor List Address Register)</description>
          <addressOffset>0x100C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SRL31" -->
            <field>
              <name>SRL31</name>
              <description>Start of Receive List</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL30" -->
            <field>
              <name>SRL30</name>
              <description>Bit30 of RDLAR</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL29" -->
            <field>
              <name>SRL29</name>
              <description>Bit29 of RDLAR</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL28" -->
            <field>
              <name>SRL28</name>
              <description>Bit28 of RDLAR</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL27" -->
            <field>
              <name>SRL27</name>
              <description>Bit27 of RDLAR</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL26" -->
            <field>
              <name>SRL26</name>
              <description>Bit26 of RDLAR</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL25" -->
            <field>
              <name>SRL25</name>
              <description>Bit25 of RDLAR</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL24" -->
            <field>
              <name>SRL24</name>
              <description>Bit24 of RDLAR</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL23" -->
            <field>
              <name>SRL23</name>
              <description>Bit23 of RDLAR</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL22" -->
            <field>
              <name>SRL22</name>
              <description>Bit22 of RDLAR</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL21" -->
            <field>
              <name>SRL21</name>
              <description>Bit21 of RDLAR</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL20" -->
            <field>
              <name>SRL20</name>
              <description>Bit20 of RDLAR</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL19" -->
            <field>
              <name>SRL19</name>
              <description>Bit19 of RDLAR</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL18" -->
            <field>
              <name>SRL18</name>
              <description>Bit18 of RDLAR</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL17" -->
            <field>
              <name>SRL17</name>
              <description>Bit17 of RDLAR</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL16" -->
            <field>
              <name>SRL16</name>
              <description>Bit16 of RDLAR</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL15" -->
            <field>
              <name>SRL15</name>
              <description>Bit15 of RDLAR</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL14" -->
            <field>
              <name>SRL14</name>
              <description>Bit14 of RDLAR</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL13" -->
            <field>
              <name>SRL13</name>
              <description>Bit13 of RDLAR</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL12" -->
            <field>
              <name>SRL12</name>
              <description>Bit12 of RDLAR</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL11" -->
            <field>
              <name>SRL11</name>
              <description>Bit11 of RDLAR</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL10" -->
            <field>
              <name>SRL10</name>
              <description>Bit10 of RDLAR</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL9" -->
            <field>
              <name>SRL9</name>
              <description>Bit9 of RDLAR</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL8" -->
            <field>
              <name>SRL8</name>
              <description>Bit8 of RDLAR</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL7" -->
            <field>
              <name>SRL7</name>
              <description>Bit7 of RDLAR</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL6" -->
            <field>
              <name>SRL6</name>
              <description>Bit6 of RDLAR</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL5" -->
            <field>
              <name>SRL5</name>
              <description>Bit5 of RDLAR</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL4" -->
            <field>
              <name>SRL4</name>
              <description>Bit4 of RDLAR</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL3" -->
            <field>
              <name>SRL3</name>
              <description>Bit3 of RDLAR</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRL2" -->
            <field>
              <name>SRL2</name>
              <description>Bit2 of RDLAR</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TDLAR" -->
        <register>
          <name>TDLAR</name>
          <description> Transmit Descriptor List Address Register</description>
          <addressOffset>0x1010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STL31" -->
            <field>
              <name>STL31</name>
              <description>Start of Transmit List</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL30" -->
            <field>
              <name>STL30</name>
              <description>Bit30 of TDLAR</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL29" -->
            <field>
              <name>STL29</name>
              <description>Bit29 of TDLAR</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL28" -->
            <field>
              <name>STL28</name>
              <description>Bit28 of TDLAR</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL27" -->
            <field>
              <name>STL27</name>
              <description>Bit27 of TDLAR</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL26" -->
            <field>
              <name>STL26</name>
              <description>Bit26 of TDLAR</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL25" -->
            <field>
              <name>STL25</name>
              <description>Bit25 of TDLAR</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL24" -->
            <field>
              <name>STL24</name>
              <description>Bit24 of TDLAR</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL23" -->
            <field>
              <name>STL23</name>
              <description>Bit23 of TDLAR</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL22" -->
            <field>
              <name>STL22</name>
              <description>Bit22 of TDLAR</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL21" -->
            <field>
              <name>STL21</name>
              <description>Bit21 of TDLAR</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL20" -->
            <field>
              <name>STL20</name>
              <description>Bit20 of TDLAR</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL19" -->
            <field>
              <name>STL19</name>
              <description>Bit19 of TDLAR</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL18" -->
            <field>
              <name>STL18</name>
              <description>Bit18 of TDLAR</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL17" -->
            <field>
              <name>STL17</name>
              <description>Bit17 of TDLAR</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL16" -->
            <field>
              <name>STL16</name>
              <description>Bit16 of TDLAR</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL15" -->
            <field>
              <name>STL15</name>
              <description>Bit15 of TDLAR</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL14" -->
            <field>
              <name>STL14</name>
              <description>Bit14 of TDLAR</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL13" -->
            <field>
              <name>STL13</name>
              <description>Bit13 of TDLAR</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL12" -->
            <field>
              <name>STL12</name>
              <description>Bit12 of TDLAR</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL11" -->
            <field>
              <name>STL11</name>
              <description>Bit11 of TDLAR</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL10" -->
            <field>
              <name>STL10</name>
              <description>Bit10 of TDLAR</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL9" -->
            <field>
              <name>STL9</name>
              <description>Bit9 of TDLAR</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL8" -->
            <field>
              <name>STL8</name>
              <description>Bit8 of TDLAR</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL7" -->
            <field>
              <name>STL7</name>
              <description>Bit7 of TDLAR</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL6" -->
            <field>
              <name>STL6</name>
              <description>Bit6 of TDLAR</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL5" -->
            <field>
              <name>STL5</name>
              <description>Bit5 of TDLAR</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL4" -->
            <field>
              <name>STL4</name>
              <description>Bit4 of TDLAR</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL3" -->
            <field>
              <name>STL3</name>
              <description>Bit3 of TDLAR</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STL2" -->
            <field>
              <name>STL2</name>
              <description>Bit2 of TDLAR</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
